

[
  {
    "image": "https://i.ibb.co.com/Xk8rJnrS/img1.jpg",
    "title": "Forest: Focus For Productivity",
    "companyName": "Forest Labs",
    "id": 1,
    "description": "Forest helps you stay focused by planting virtual trees that grow as you work. Every time you resist distractions and focus on your tasks, your digital forest flourishes. It's a creative and rewarding way to manage your time and enhance productivity. The app also tracks your progress and motivates you to avoid phone addiction by linking focus sessions with real tree planting efforts worldwide.",
    "size": "31MB",
    "reviews": "325K",
    "ratingAvg": 4.6,
    "downloads": "7.6M",
    "ratings": [
      { "name": "1 star", "count": 370 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 3300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MDYwGLLb/img2.webp",
    "title": "Pomodoro Timer Pro",
    "companyName": "FocusMaster",
    "id": 2,
    "description": "Pomodoro Timer Pro makes time management simple and efficient. Based on the Pomodoro Technique, it helps you break work into focused sessions separated by short breaks. The clean interface and customizable session lengths make it ideal for students, freelancers, and professionals. Track your productivity trends and stay motivated with progress analytics built right into the app.",
    "size": "22MB",
    "reviews": "280K",
    "ratingAvg": 4.4,
    "downloads": "3.1M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/B2d80HSq/img-3.webp",
    "title": "Calm: Meditation & Sleep",
    "companyName": "Calm Inc.",
    "id": 3,
    "description": "Calm is the ultimate app for mindfulness, meditation, and better sleep. With guided sessions, nature sounds, and breathing exercises, it helps reduce stress and anxiety. Whether you’re a beginner or an expert, Calm provides personalized routines for mental wellness. Its sleep stories, soothing music, and expert-led programs create a peaceful environment for rest and relaxation.",
    "size": "50MB",
    "reviews": "1000K",
    "ratingAvg": 4.8,
    "downloads": "12.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 2100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rR6sc6mK/img4.jpg",
    "title": "Notion: Notes & Tasks",
    "companyName": "Notion Labs",
    "id": 4,
    "description": "Notion is an all-in-one workspace that combines notes, tasks, databases, and wikis in one place. It’s perfect for individuals and teams who need flexibility and organization. You can manage projects, plan goals, and collaborate in real-time. The app’s drag-and-drop interface and templates make it easy to create anything from personal journals to complex company dashboards.",
    "size": "45MB",
    "reviews": "870K",
    "ratingAvg": 4.7,
    "downloads": "9.8M",
    "ratings": [
      { "name": "1 star", "count": 360 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 3000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Pv3CX6zn/img5.jpg",
    "title": "Spotify Music",
    "companyName": "Spotify Ltd.",
    "id": 5,
    "description": "Spotify lets you stream millions of songs, albums, and podcasts from artists worldwide. With personalized playlists, offline downloads, and AI-driven recommendations, it redefines how you listen to music. Discover new genres, share your favorite tracks, and create your own mood-based playlists. Spotify delivers an unmatched music experience anytime, anywhere.",
    "size": "68MB",
    "reviews": "2000K",
    "ratingAvg": 4.9,
    "downloads": "250M",
    "ratings": [
      { "name": "1 star", "count": 360 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 880 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Gv2Q1sPR/img6.jpg",
    "title": "Todoist: To-Do List",
    "companyName": "Doist Ltd.",
    "id": 6,
    "description": "Todoist is a task manager that helps you organize your life, projects, and daily routines. You can create tasks, set priorities, and add reminders across devices. The app offers productivity insights and collaboration features that make it great for both individuals and teams. Stay productive, reduce stress, and achieve goals efficiently with Todoist.",
    "size": "29MB",
    "reviews": "640K",
    "ratingAvg": 4.5,
    "downloads": "8.3M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 8100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4ZyjGnN2/Image-7.jpg",
    "title": "Headspace: Mindful Meditation",
    "companyName": "Headspace Inc.",
    "id": 7,
    "description": "Headspace is your personal guide to mindfulness and better mental health. With guided meditations, breathing techniques, and focus sessions, it helps reduce anxiety and improve sleep quality. The app’s simple design and progress tracking make it easy to maintain a daily meditation habit. From beginners to experts, Headspace supports everyone’s mental wellness journey.",
    "size": "40MB",
    "reviews": "920K",
    "ratingAvg": 4.7,
    "downloads": "10.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WpHJNzwR/img8.png",
    "title": "Focus Keeper",
    "companyName": "Levan Apps",
    "id": 8,
    "description": "Focus Keeper is designed to help you maintain focus and avoid burnout using the Pomodoro technique. With a simple interface and customizable timers, it keeps you engaged in short, productive work intervals followed by relaxing breaks. Track your focus sessions over time, visualize productivity stats, and maintain a balanced work rhythm for better mental health and efficiency.",
    "size": "22MB",
    "reviews": "290K",
    "ratingAvg": 4.3,
    "downloads": "2.1M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 570 },
      { "name": "3 star", "count": 850 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 3800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/V0G9mp6g/10Image.jpg",
    "title": "Evernote: Notes Organizer",
    "companyName": "Evernote Corp.",
    "id": 9,
    "description": "Evernote is your digital workspace for capturing ideas, managing tasks, and keeping everything organized. You can store notes, checklists, images, and voice memos all in one place. With cloud sync, your data is accessible anywhere. Perfect for students and professionals, Evernote helps you stay productive and creative by turning thoughts into structured, actionable plans.",
    "size": "50MB",
    "reviews": "1450K",
    "ratingAvg": 4.6,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 3600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TqLXPy47/img10.jpg",
    "title": "Trello: Team Projects",
    "companyName": "Atlassian",
    "id": 10,
    "description": "Trello is a visual collaboration tool that helps teams manage projects with boards, lists, and cards. You can assign tasks, set deadlines, and monitor progress in real time. It’s intuitive, flexible, and perfect for agile workflows. Trello integrates with hundreds of tools, helping teams streamline communication, track goals, and boost productivity across departments.",
    "size": "38MB",
    "reviews": "1340K",
    "ratingAvg": 4.7,
    "downloads": "11.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 530 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7xSZh7xZ/img111.png",
    "title": "Habit Tracker",
    "companyName": "Trackify",
    "id": 11,
    "description": "Habit Tracker helps you build good habits and break bad ones with consistency tracking and progress insights. You can visualize your streaks, set reminders, and celebrate milestones. The clean design and motivational features encourage daily commitment. Whether it’s exercising, reading, or meditating, Habit Tracker keeps your goals visible and achievable every day.",
    "size": "21MB",
    "reviews": "300K",
    "ratingAvg": 4.4,
    "downloads": "1.5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 3200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/hxBdjkfy/images12.png",
    "title": "Mindful Breathing",
    "companyName": "ZenTech",
    "id": 12,
    "description": "Mindful Breathing teaches powerful breathing exercises to help calm your mind, reduce stress, and increase focus. With guided audio sessions and visual cues, you can practice anywhere, anytime. The app adapts to your goals, whether you need to relax, energize, or sleep better. Over time, it improves mental clarity and emotional balance through simple daily practice.",
    "size": "18MB",
    "reviews": "250K",
    "ratingAvg": 4.5,
    "downloads": "1.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 850 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3600 }
    ]
  },
  {
    "image": "https://i.ibb.co/pzTm1hB/focus-timer.jpg",
    "title": "Focus Timer",
    "companyName": "Productivity Apps",
    "id": 13,
    "description": "Focus Timer is built for productivity enthusiasts who follow the Pomodoro method. It helps you stay disciplined with structured focus intervals and automatic break reminders. Track your performance, measure focus duration, and view weekly productivity stats. The minimalist design and gentle notifications make it easy to build strong focus habits over time.",
    "size": "23MB",
    "reviews": "310K",
    "ratingAvg": 4.3,
    "downloads": "1.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 860 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZRxG7Fbx/img14.jpg",
    "title": "Sleep Sounds",
    "companyName": "Relax Inc.",
    "id": 14,
    "description": "Sleep Sounds provides a relaxing collection of ambient sounds, white noise, and nature tracks to help you sleep better. Choose from rain, ocean, forest, or fireplace sounds to create your perfect bedtime atmosphere. You can set timers, mix sounds, and use offline playback. It’s perfect for reducing insomnia, relaxing the mind, and improving your nightly rest quality.",
    "size": "35MB",
    "reviews": "700K",
    "ratingAvg": 4.6,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 880 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3500 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co/YD7c7mD/app15.png",
    "title": "Photo Enhancer Pro",
    "downloads": "870K",
    "size": "24MB",
    "ratingAvg": "4.7",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 570 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3400 }
    ],
    "description": "Photo Enhancer Pro brings out the hidden beauty in your photos with advanced AI-powered filters and lighting correction. Whether it’s low-light portraits or dull landscapes, this app enhances color balance and sharpness with a single tap. Perfect for both casual users and photography enthusiasts, it offers natural tone restoration, background blur, and noise reduction. Share your masterpieces instantly on social platforms and amaze your friends with professional-grade images."
  },
  {
    "id": 16,
    "image": "https://i.ibb.co/FwxpTx5/app16.png",
    "title": "Music Flow Studio",
    "downloads": "1.1M",
    "size": "35MB",
    "ratingAvg": "4.8",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 590 },
      { "name": "3 star", "count": 840 },
      { "name": "4 star", "count": 1300 },
      { "name": "5 star", "count": 3200 }
    ],
    "description": "Music Flow Studio is a powerful music player and mixer designed for people who love to customize their listening experience. It features a built-in equalizer, reverb controls, and 3D surround effects that transform your sound into a concert-like experience. You can create playlists, mix songs, and even add fade transitions between tracks. With its intuitive interface and offline support, Music Flow Studio keeps your music alive anywhere, anytime, with pure rhythm and clarity."
  },
  {
    "id": 17,
    "image": "https://i.ibb.co/Vjh1Gvg/app17.png",
    "title": "Weather Vista",
    "downloads": "640K",
    "size": "18MB",
    "ratingAvg": "4.5",
     "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1570 },
      { "name": "5 star", "count": 3100 }
    ],
    "description": "Weather Vista gives you real-time weather updates with detailed forecasts for temperature, humidity, wind speed, and air quality. Its sleek interface visualizes live radar and satellite data for your location and beyond. Whether you’re planning a trip or just dressing for the day, Weather Vista’s smart alerts notify you about sudden changes like storms or heavy rain. Stay prepared and safe with the most accurate and visually stunning weather app available."
  },
  {
    "id": 18,
    "image": "https://i.ibb.co/6B7kqvN/app18.png",
    "title": "NoteKeeper",
    "downloads": "720K",
    "size": "14MB",
    "ratingAvg": "4.6",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 530 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1570 },
      { "name": "5 star", "count": 3500 }
    ],
    "description": "NoteKeeper helps you organize your ideas, tasks, and projects efficiently. With features like color-coded notebooks, password protection, and cloud sync, it’s the ultimate tool for students, professionals, and creative thinkers. You can add voice notes, sketches, and checklists, all within a distraction-free interface. NoteKeeper automatically backs up your data so your ideas never get lost — your thoughts, goals, and plans all stay right where you need them, safe and accessible anytime."
  },
  {
    "id": 19,
    "image": "https://i.ibb.co/5sMkkpM/app19.png",
    "title": "FitTrack Pro",
    "downloads": "930K",
    "size": "27MB",
    "ratingAvg": "4.9",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 1090 },
      { "name": "5 star", "count": 3100 }
    ],
    "description": "FitTrack Pro is your personal fitness assistant, designed to track your workouts, calories, and sleep patterns in one easy app. It offers personalized plans for weight loss, muscle gain, and stamina building based on your goals. Real-time heart rate and step tracking help you monitor progress effortlessly. Its daily motivation and progress charts push you to stay consistent. Whether at home or in the gym, FitTrack Pro keeps your fitness journey on track and exciting."
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/Rv7Nn2Y/app20.png",
    "title": "TaskMaster",
    "downloads": "880K",
    "size": "19MB",
    "ratingAvg": "4.6",
    "ratings": [
      { "name": "1 star", "count": 980 },
      { "name": "2 star", "count": 1400 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3000 }
    ],
    "description": "TaskMaster simplifies productivity by helping you manage your to-do lists and deadlines efficiently. Its clean UI, smart reminders, and daily planner keep your work organized. With cloud sync and collaborative task sharing, you can easily work with teammates or family. TaskMaster also offers priority labeling, progress tracking, and motivational analytics. Never forget a single goal again — TaskMaster ensures that every day feels productive and stress-free."
  },
  {
    "id": 21,
    "image": "https://i.ibb.co/8XjFk2r/app21.png",
    "title": "Language Buddy",
    "downloads": "560K",
    "size": "25MB",
    "ratingAvg": "4.4",
    "ratings": [
      { "name": "1 star", "count": 1300 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 9500 },
      { "name": "5 star", "count": 4100 }
    ],
    "description": "Language Buddy helps you learn new languages through fun, interactive lessons and quizzes. Whether it’s English, Spanish, French, or Korean, the app adapts to your skill level and learning pace. It features audio pronunciation, grammar correction, and AI-driven conversation practice. Daily streaks and achievements motivate you to keep learning. With offline lessons and gamified rewards, Language Buddy turns language learning into a joyful adventure."
  },
  {
    "id": 22,
    "image": "https://i.ibb.co/7bDmRbc/app22.png",
    "title": "CookBook Studio",
    "downloads": "1.3M",
    "size": "31MB",
    "ratingAvg": "4.8",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 5100 }
    ],
    "description": "CookBook Studio is your kitchen companion for discovering and saving amazing recipes. From traditional dishes to modern desserts, explore thousands of step-by-step recipes with photos and videos. It includes ingredient substitution, portion adjustment, and grocery list generation. Whether you’re a beginner or a pro, CookBook Studio helps you master cooking with ease, turning every meal into a delightful experience for family and friends."
  },
  {
    "id": 23,
    "image": "https://i.ibb.co/mS3TTXL/app23.png",
    "title": "Study Planner",
    "downloads": "450K",
    "size": "17MB",
    "ratingAvg": "4.5",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 3600 }
    ],
    "description": "Study Planner helps students manage their study schedules, track assignments, and stay focused on goals. Its smart reminders, progress tracking, and subject-based organization make study life smoother. You can record grades, attach lecture notes, and even set exam countdowns. Designed for high school and university students, Study Planner ensures productivity while reducing stress. It’s the ultimate companion for achieving academic success with confidence."
  },
  {
    "id": 24,
    "image": "https://i.ibb.co/9nK7nDN/app24.png",
    "title": "BudgetEase",
    "downloads": "780K",
    "size": "22MB",
    "ratingAvg": "4.7",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 530 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 7590 },
      { "name": "5 star", "count": 3120 }
    ],
    "description": "BudgetEase makes managing your finances effortless. Track expenses, set budgets, and get insights into your spending habits. The app automatically categorizes transactions and provides detailed reports so you can save smarter. With BudgetEase, you’ll always know where your money goes and how to plan for the future. Secure, private, and user-friendly, it’s your digital accountant that works 24/7 to help you achieve financial freedom."
  },
  {
    "id": 25,
    "image": "https://i.ibb.co/LRCb3rs/app25.png",
    "title": "MindRelax",
    "downloads": "970K",
    "size": "29MB",
    "ratingAvg": "4.8",
   "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 6100 }
    ],
    "description": "MindRelax offers soothing sounds, guided meditations, and mindfulness exercises to help you unwind and sleep better. Whether it’s stress, anxiety, or insomnia, MindRelax brings peace through natural soundscapes and breathing techniques. You can customize your relaxation experience with background music, timer options, and offline mode. Perfect for busy minds seeking calm, it transforms your daily routine into moments of tranquility and balance."
  },
  {
    "id": 26,
    "image": "https://i.ibb.co/fGzRtv8/app26.png",
    "title": "FileVault",
    "downloads": "660K",
    "size": "15MB",
    "ratingAvg": "4.6",
    "ratings": [
      { "name": "1 star", "count": 330 },
      { "name": "2 star", "count": 530 },
      { "name": "3 star", "count": 830 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 3200 }
    ],
    "description": "FileVault is your digital locker for photos, documents, and private files. It encrypts and hides sensitive data with high-level security, ensuring complete privacy. You can organize files into folders, backup to cloud storage, and restore them anytime. With fingerprint unlock and intrusion alerts, FileVault keeps your digital life protected. It’s simple, lightweight, and essential for anyone who values data safety and peace of mind."
  },
  {
    "id": 27,
    "image": "https://i.ibb.co/Y2VFxz6/app27.png",
    "title": "Eventify",
    "downloads": "510K",
    "size": "26MB",
    "ratingAvg": "4.5",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3100 }
    ],
    "description": "Eventify helps you discover and manage events around you — from concerts to workshops. You can buy tickets, set reminders, and invite friends easily. Its personalized recommendations ensure you never miss events that match your interests. Eventify also lets organizers list and promote their own events, making it a platform for both creators and explorers. With a clean interface and smart filters, it makes social life more vibrant and organized."
  },
  {
    "id": 28,
    "image": "https://i.ibb.co/MPdMHTb/app28.png",
    "title": "SecureMail",
    "downloads": "890K",
    "size": "23MB",
    "ratingAvg": "4.7",
    "ratings": [
      { "name": "1 star", "count": 380 },
      { "name": "2 star", "count": 560 },
      { "name": "3 star", "count": 870 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 3300 }
    ],
    "description": "SecureMail is a privacy-focused email client that protects your messages with end-to-end encryption. It ensures no third party can read your emails, even on public Wi-Fi. You can organize mail with smart filters, schedule sends, and get spam-free inbox management. With a clean interface and fast sync, SecureMail makes communication secure yet effortless. It’s built for professionals and privacy lovers who value confidentiality and trust above all."
  }
]


